
//Вивести числа від 20 до 30 через пропуск використовуючи крок 0,5 (20 20,5 21 21,5….)
/*
let uns =""
for (let i=20; i <=30; i += 0.5) {
    uns += i + " ";
    
}
console.log (uns);
*/

//Один долар коштує 40 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів
/*
let dollar = ""

for (let i = 10; i <= 100; i += 10) {
    dollar += i + " dollar" + " = " + i * 40 + " grn\n"
}
    
console.log(dollar);
*/

//Дано ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N

/*
let N = Number(prompt("введите число N"));

for (let i = 1; i <= 100; i++) {
    if (i * i <= N) {
        console.log (i);
    }
}
*/

//Дано ціле число. З'ясувати, чи воно простим (простим називається число, більше ніж 1, які мають інших дільників крім 1 і себе).
/*
let num = Number(prompt("Введите число"));

let isPrime = true;  

for (let i = 2; i < num; i++) {
    if (num % i == 0) {  
        isPrime = false;
        console.log("Число не простое");
        break;  
    }
}

if (isPrime && num > 1) {  
    console.log("Число простое");
} else if (num <= 1) {  
    console.log("Число должно быть больше 1");
}
*/


//Дано деяке число. Ваше завдання – визначити, чи можна отримати це число, піднявши число 3 до певного натурального ступеня. (Як приклад, числа 9 та 81 можна отримати цим способом, але 13 – ні.)

/* очень сложно вышло (подсматривал)
let num3 = Number(prompt("Введите число"));

while (num3 > 1) {
    if (num3 % 3 !== 0) {
        console.log("Число не можна отримати піднявши 3 до певного ступеня");
        num3 = -1; 
        break;
    }
    num3 = num3 / 3;
}

if (num3 === 1) {
    console.log("Число можна отримати піднявши 3 до певного ступеня");
}

*/